LEXICON: dict[str, str] = {
    'cat': 'Выберите категорию картины 🎨:',
    'sub_cat': 'Выберите подкатегорию картины 🖼️:',
    'item_id': 'Выберите картину 🖌️:',
    'change': '⬆️Выберите товар из представленных выше⬆️',
    'back': '⏪ Назад ⏪',
    'reset': '🔄 Выбрать заново',
    'error': '⚠️ Мы уже выбираем картину, закончите оформление или нажмите /reset',
    'pay': '💳 Оформить заказ',
    'pay_process': '🎉 Благодарим вас за выбор! Продолжите оформление или напишите сразу <a href="https://t.me/and_reut">нам</a> переслав это сообщение 🎉\n Ваша картина:',
    'adress': 'Введите адрес ближайшего к вам отделения Почты России ✉️\n',
    'success': '🎉 Благодарим вас за выбор! Напишите <a href="https://t.me/and_reut">нам</a> для уточнения деталей.\n\n'
               'Можете выбрать еще картину, для этого нажмите: /start',
    '/start': '👋 Это бот, в котором вы можете заказать авторские картины <a '
              'href="https://t.me/moJbiZM4R1QyMmZi">Марьям Зианбетовой</a>.\n\n'
              'Чтобы посмотреть список доступных команд, наберите /help.\n\n',
    '/help': 'ℹ️ Это бот для заказа авторских картин <a href="https://t.me/moJbiZM4R1QyMmZi">Марьям '
             'Зианбетовой</a>.\n\nДоступные команды:\n\n'
             '/contacts - Контакты для связи 📞.\n\n'
             '/reset - Сброс состояния бота (Полностью перезапускает бота, импользуйте при обнаружении его некорректной работы)\n\n'
             'Процесс заказа картин:\n'
             '1. Выберите категорию 🎨\n'
             '2. Выберите подкатегорию 🖼️\n'
             '3. Выберите картину 🖌️\n'
             '4. Напишите адрес ближайшего отделения почты ✉️\n'
             '5. Напишите <a href="https://t.me/and_reut">нам</a> для уточнения деталей. С вами свяжется менеджер для '
             'обсуждения условий оплаты и доставки.✅',
    '/contacts': '<a href="https://t.me/moJbiZM4R1QyMmZi">Творчество Марьям Зианбетовой</a> 🎨\n\n'
                 '<a href="https://t.me/and_reut">По техническим вопросам работы бота</a> 🛠️',
    '/reset': '🔄 Сброс состояния бота 🔄',
    'other': 'Извините, я вас не понимаю. Вы можете только заказать картины 🖼️.'
}

LEXICON_COMMANDS: dict[str, str] = {
    '/start': '🛒 Начать заказ',
    '/help': '❓ Справка по работе бота',
    '/contacts': '📞 Контакты для связи',
    '/reset': '🔄 Сброс состояния бота '
}
